extra/doom/config.org
***** Configuration
#+begin_src emacs-lisp
(use-package! clutch
  :defer t
  :config
  (setq clutch-connect-timeout-seconds 10
        clutch-read-idle-timeout-seconds 30
        clutch-query-timeout-seconds 20
        clutch-jdbc-rpc-timeout-seconds 15))
#+end_src

***** Connections JSON
#+begin_src emacs-lisp
(require 'json)
(require 'subr-x)

(defvar mp/clutch-connections-file
  (expand-file-name "connections.json" doom-user-dir))

(defun mp/clutch--json-key-to-keyword (key)
  (intern (concat ":" key)))

(defun mp/clutch--json-object-to-plist (obj)
  (let (plist)
    (dolist (pair obj (nreverse plist))
      (let ((key (car pair))
            (value (cdr pair)))
        (setq plist
              (cons value
                    (cons (mp/clutch--json-key-to-keyword key)
                          plist)))))))

(defun mp/clutch--uri-to-plist (uri)
  (cond
   ;; PostgreSQL:
   ;; postgresql://user:pass@host:5432/database
   ((string-match
     "\\`\\(postgresql\\|postgres\\)://\\(?:\\([^:/@]+\\)\\(?::\\([^@/]*\\)\\)?@\\)?\\([^:/]+\\)\\(?::\\([0-9]+\\)\\)?/\\(.+\\)\\'"
     uri)
    (let ((user (match-string 2 uri))
          (password (match-string 3 uri))
          (host (match-string 4 uri))
          (port (match-string 5 uri))
          (database (match-string 6 uri)))
      (append
       (list :backend 'pg
             :host host
             :database (url-unhex-string database))
       (when port
         (list :port (string-to-number port)))
       (when user
         (list :user (url-unhex-string user)))
       (when password
         (list :password (url-unhex-string password))))))

   ;; MySQL:
   ;; mysql://user:pass@host:3306/database
   ((string-match
     "\\`mysql://\\(?:\\([^:/@]+\\)\\(?::\\([^@/]*\\)\\)?@\\)?\\([^:/]+\\)\\(?::\\([0-9]+\\)\\)?/\\(.+\\)\\'"
     uri)
    (let ((user (match-string 1 uri))
          (password (match-string 2 uri))
          (host (match-string 3 uri))
          (port (match-string 4 uri))
          (database (match-string 5 uri)))
      (append
       (list :backend 'mysql
             :host host
             :database (url-unhex-string database))
       (when port
         (list :port (string-to-number port)))
       (when user
         (list :user (url-unhex-string user)))
       (when password
         (list :password (url-unhex-string password))))))

   ;; SQLite:
   ;; sqlite:///home/mahdi/sqlite.db
   ((string-match "\\`sqlite://\\(.+\\)\\'" uri)
    (list :backend 'sqlite
          :database (url-unhex-string (match-string 1 uri))))

   (t
    (user-error "Unsupported connection URI: %s" uri))))

(defun mp/clutch--normalize-backend (plist)
  (let ((backend (plist-get plist :backend)))
    (plist-put plist :backend
               (cond
                ((symbolp backend) backend)
                ((string= backend "postgres") 'pg)
                ((string= backend "postgresql") 'pg)
                ((string= backend "pg") 'pg)
                ((string= backend "mysql") 'mysql)
                ((string= backend "sqlite") 'sqlite)
                (t (intern backend))))))

(defun mp/clutch--normalize-connection (value)
  (cond
   ((stringp value)
    (mp/clutch--uri-to-plist value))
   ((listp value)
    (mp/clutch--normalize-backend
     (mp/clutch--json-object-to-plist value)))
   (t
    (user-error "Invalid connection value: %S" value))))

(defun mp/clutch-load-connections ()
  (when (file-exists-p mp/clutch-connections-file)
    (let ((json-object-type 'alist)
          (json-array-type 'list)
          (json-key-type 'string))
      (mapcar
       (lambda (entry)
         (cons (car entry)
               (mp/clutch--normalize-connection (cdr entry))))
       (json-read-file mp/clutch-connections-file)))))

(defun mp/clutch-apply-connections ()
  (interactive)
  (setq clutch-connection-alist
        (mp/clutch-load-connections))
  (message "Loaded %d Clutch connections from %s"
           (length clutch-connection-alist)
           mp/clutch-connections-file))

(with-eval-after-load 'clutch
  (mp/clutch-apply-connections))
#+end_src

***** Keybindings
#+begin_src emacs-lisp
(map! :leader
      :desc "Clutch query console"
      "o s" #'clutch-query-console)
#+end_src

*** AI Agents and Completion
**** Agent Shell
Agent shell is a core part of this setup, so related integrations live together here.

***** Desktop Notifications
Enable desktop notifications for agent-shell buffers so turns that need attention can surface even when the shell is out of focus.

#+begin_src emacs-lisp
(use-package! agent-shell-notifications
  :hook (agent-shell-mode . agent-shell-notifications-mode))
#+end_src

**** AI Suggestions
Minuet is installed as a Doom package and kept manual-only.  Use =SPC d s= to request a suggestion and =SPC d m= to configure the provider; the remaining keys apply while a Minuet suggestion is visible.

#+begin_src emacs-lisp
(use-package! minuet
  :commands (minuet-show-suggestion
             minuet-configure-provider
             minuet-previous-suggestion
             minuet-next-suggestion
             minuet-accept-suggestion
             minuet-dismiss-suggestion
             minuet-accept-suggestion-line)
  :init
  (map! :leader
        (:prefix ("d" . "agent")
         :desc "Show Minuet suggestion" "s" #'minuet-show-suggestion
         :desc "Configure Minuet provider" "m" #'minuet-configure-provider))
  :config
  (setq minuet-provider 'codestral)
  (plist-put minuet-codestral-options :api-key "CODESTRAL_API_KEY")
  (minuet-set-optional-options minuet-codestral-options :stop `("\n\n"))
  (minuet-set-optional-options minuet-codestral-options :max_tokens 1024)
  (setq minuet-show-error-message-on-minibuffer t
        minuet-request-timeout 10))
#+end_src

*** Session Behavior
**** Emacs

Quit confirmation is disabled for faster exits.

#+begin_src emacs-lisp
(setq confirm-kill-emacs nil)
#+end_src

*** Editing
**** Multi Cursor
#+begin_src emacs-lisp
(use-package! evil-mc
  :after evil
  :config
  (global-evil-mc-mode 1)

  (map! :n "C-M-<down>"  #'evil-mc-make-cursor-move-next-line
        :n "C-M-<up>"    #'evil-mc-make-cursor-move-prev-line
        :n "C-M-<right>" #'evil-mc-make-all-cursors)

  (defun my/evil-mc-escape ()
    (interactive)
    (if (and (bound-and-true-p evil-mc-mode)
             evil-mc-cursor-list)
        (evil-mc-undo-all-cursors)
      (evil-force-normal-state)))

  (map! :i "<escape>" #'my/evil-mc-escape
        :n "<escape>" #'my/evil-mc-escape))

(map! :nv "C-d" #'evil-multiedit-match-and-next
      :i  "C-d" #'evil-multiedit-toggle-marker-here)
#+end_src

**** Find in project
*** Scripts
**** Project Scripts runner
#+begin_src emacs-lisp
(defvar my/project-running-scripts (make-hash-table :test 'equal))

(defun my/project-scripts-dir ()
  (expand-file-name "__ignore__/scripts/" (projectile-project-root)))

(defun my/project-script-files ()
  (let ((dir (my/project-scripts-dir)))
    (when (file-directory-p dir)
      (directory-files dir t "\\.sh$"))))

(defun my/project-script-label (file)
  (let* ((project (projectile-project-root))
         (key (concat project "::" file))
         (name (file-name-base file)))
    (if (gethash key my/project-running-scripts)
        (concat "✓ " name)
      name)))

(defun my/run-project-script ()
  "Pick a project script and run it in a vterm buffer."
  (interactive)
  (let* ((project (projectile-project-root))
         (files (my/project-script-files)))
    (unless files
      (user-error "No scripts found in __ignore__/scripts/"))

    (let* ((choices
            (mapcar (lambda (file)
                      (cons (my/project-script-label file) file))
                    files))
           (picked-label (completing-read "Run script: " choices nil t))
           (file (cdr (assoc picked-label choices)))
           (name (file-name-base file))
           (key (concat project "::" file))
           (buf-name (format "*project:%s*" name)))

      (puthash key t my/project-running-scripts)

      (let ((default-directory project))
        (vterm buf-name)
        (vterm-send-string (shell-quote-argument file))
        (vterm-send-return)
        (delete-other-windows)))))

(map! :leader
      :desc "Run project script"
      "p S" #'my/run-project-script)
#+end_src

*** Org Mode
#+begin_src emacs-lisp
;;; org-basic.el --- sane Org defaults for Doom

;; Main Org directory.
(setq org-directory "~/org/")

;; Files scanned by org-agenda.
;; Only put actionable/date-based files here.
(setq org-agenda-files
      '("~/org/inbox.org"
        "~/org/tasks.org"
        "~/org/projects.org"
        "~/org/calendar.org"))

;; Basic TODO workflow.
;; TODO      = not started
;; NEXT      = next concrete action
;; WAIT      = blocked by someone/something
;; SOMEDAY   = intentionally inactive
;; DONE      = completed
;; CANCELLED = no longer relevant
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "WAIT(w)" "SOMEDAY(s)" "|"
                  "DONE(d)" "CANCELLED(c)")))

;; Save timestamp when marking DONE.
(setq org-log-done 'time)

;; Save note when moving into WAIT or CANCELLED.
(setq org-todo-keyword-faces
      '(("TODO" . warning)
        ("NEXT" . success)
        ("WAIT" . font-lock-constant-face)
        ("SOMEDAY" . font-lock-doc-face)
        ("DONE" . shadow)
        ("CANCELLED" . shadow)))

(setq org-todo-keywords
      '((sequence "TODO" "|" "DONE")))

;; Use fast todo selection.
(setq org-use-fast-todo-selection t)

;; Hide completed scheduled/deadline tasks from agenda after done.
(setq org-agenda-skip-scheduled-if-done t)
(setq org-agenda-skip-deadline-if-done t)

;; Show agenda starting today.
;; (setq org-agenda-start-on-weekday nil)

;; Show 14 days by default.
(setq org-agenda-span 14)

;; Warn about deadlines 7 days in advance.
(setq org-deadline-warning-days 7)

;; Make indentation readable.
(setq org-startup-indented t)

;; Hide leading stars visually.
(setq org-hide-leading-stars t)

;; Open folded files cleanly.
(setq org-startup-folded 'content)

;; Log state changes into a drawer to avoid visual noise.
(setq org-log-into-drawer t)

;; Refile targets.
;; This lets you move captured items from inbox.org into real files.
(setq org-refile-targets
      '(("~/org/tasks.org" :maxlevel . 3)
        ("~/org/projects.org" :maxlevel . 4)
        ("~/org/calendar.org" :maxlevel . 2)
        ("~/org/someday.org" :maxlevel . 2)))

;; Make refile completion use full paths.
(setq org-refile-use-outline-path 'file)
(setq org-outline-path-complete-in-steps nil)

;; Archive completed old tasks here.
(setq org-archive-location "~/org/archive.org::* From %s")

;; Capture templates.
(setq org-capture-templates
      '(("t" "Todo" entry
         (file "~/org/inbox.org")
         "* TODO %?\nCREATED: %U\n")

        ("d" "Todo with deadline" entry
         (file "~/org/inbox.org")
         "* TODO %?\nDEADLINE: %^t\nCREATED: %U\n")

        ("s" "Scheduled todo" entry
         (file "~/org/inbox.org")
         "* TODO %?\nSCHEDULED: %^t\nCREATED: %U\n")

        ("e" "Event / calendar date" entry
         (file "~/org/calendar.org")
         "* %?\n%^T\n")

        ("r" "Repeating event" entry
         (file "~/org/calendar.org")
         "* %?\n%^T\n")

        ("p" "Project task" entry
         (file "~/org/projects.org")
         "* TODO %?\nCREATED: %U\n")

        ("n" "Note" entry
         (file "~/org/notes.org")
         "* %?\nCREATED: %U\n")))

;; Custom agenda views.
(setq org-agenda-custom-commands
      '(("d" "Dashboard"
         ((agenda "" ((org-agenda-span 14)))
          (todo "NEXT"
                ((org-agenda-overriding-header "Next actions")))
          (todo "WAIT"
                ((org-agenda-overriding-header "Waiting")))
          (todo "TODO"
                ((org-agenda-overriding-header "Unprocessed todos")))))

        ("i" "Inbox"
         ((tags "REFILE|TODO"
                ((org-agenda-files '("~/org/inbox.org"))
                 (org-agenda-overriding-header "Inbox")))))

        ("p" "Projects"
         ((tags "project"
                ((org-agenda-overriding-header "Projects")))))))
#+end_src
*** Future Configuration
Reserved sections for later additions so new config does not need to be bolted onto the end of the file.

**** Local Machine Or OS-Specific Settings
Use this section for machine-specific behavior, platform-specific shell paths, or display quirks.

**** Language-Specific Overrides
Use this section for per-language helpers that do not belong in the shared project-root or tooling sections.

**** Workflow Automation
Use this section for commands, macros, transient menus, and integrations that automate recurring tasks.

**** Temporary Experiments
Use this section for short-lived experiments before they are promoted into a stable section above or removed.
** Packages
:PROPERTIES:
:header-args:emacs-lisp: :tangle packages.el
:END:

*** Lexical binding
#+begin_src emacs-lisp
;;; packages.el -*- lexical-binding: t; -*-
#+end_src

*** General
- https://github.com/gabesoft/evil-mc
- https://github.com/minad/org-modern
- https://github.com/tumashu/vertico-posframe
- https://github.com/karthink/consult-dir

#+begin_src emacs-lisp
;; multi cursor
(package! evil-mc)
(package! org-modern)
(package! vertico-posframe)
(package! consult-dir)
#+end_src

*** AI
- https://github.com/xenodium/acp.el
- https://github.com/xenodium/agent-shell
- https://github.com/zackattackz/agent-shell-notifications
- https://github.com/milanglacier/minuet-ai.el

#+begin_src emacs-lisp
(package! acp)
(package! agent-shell)
(package! agent-shell-notifications
  :recipe (:host github :repo "zackattackz/agent-shell-notifications"))
(package! minuet)
#+end_src

*** Programming
**** General
- https://github.com/casouri/eldoc-box
- https://github.com/pwalsh/pipenv.el

#+begin_src emacs-lisp
(package! eldoc-box)
;; Keep `pipenv` disabled, but leave the declaration so Doom won't re-enable it
;; if package state changes during future experiments.
(package! pipenv :disable t)
#+end_src

*** Visuals
- https://github.com/xenodium/shell-maker
- https://github.com/rnkn/olivetti
- https://github.com/protesilaos/spacious-padding
- https://github.com/gonewest818/dimmer.el

#+begin_src emacs-lisp
(package! shell-maker)
(package! olivetti)
(package! spacious-padding)
(package! dimmer)
#+end_src

*** Database
- https://github.com/LuciusChen/clutch
- https://github.com/emarsden/pg-el
- https://github.com/LuciusChen/mysql.el

#+begin_src emacs-lisp
(package! clutch)
(package! pg)
(package! mysql)
#+end_src
